In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# **DAY 1 CHALLENGE**

In [ ]:
%sql sqlite:///DATA_ABC.db

In [ ]:
%%sql
CREATE TABLE customers(
customer_id INT,
first_name VARCHAR(20),
last_name VARCHAR(20),
email VARCHAR(30)
);

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE products(
product_id INT,
product_name VARCHAR(30),
price DECIMAL(10,2)
)

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE orders(
  order_id INT,
  customer_id INT,
  order_date DATE
);

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql CREATE TABLE order_items(
    order_id INT,
                               product_id INT,
                               quantity INT


);

 * sqlite:///DATA_ABC.db
Done.

[]

# **DAY 2 CHALLENGE**

In [ ]:
%%sql
 INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///DATA_ABC.db
13 rows affected.

[]

In [ ]:
%%sql
   INSERT INTO products (product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///DATA_ABC.db
13 rows affected.

[]

In [ ]:
%%sql
    INSERT INTO orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///DATA_ABC.db
16 rows affected.

[]

In [ ]:
%%sql
 INSERT INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///DATA_ABC.db
32 rows affected.

[]

# **DAY 3 CHALLENGE**

In [ ]:
%%sql
SELECT product_id FROM products WHERE price=70;

 * sqlite:///DATA_ABC.db
Done.

[(13,)]

In [ ]:
%%sql
SELECT order_id FROM order_items WHERE quantity=4;

 * sqlite:///DATA_ABC.db
Done.

[(4,)]

# **DAY 4 CHALLENGE**

In [ ]:
%%sql
SELECT customer_id FROM orders WHERE order_id=4;

 * sqlite:///DATA_ABC.db
Done.

[(1,)]

In [ ]:
%%sql
SELECT product_name,price * SUM(quantity) AS total_revenue FROM products,orders,order_items

 * sqlite:///DATA_ABC.db
Done.

[('Product A', 126880)]

# **DAY 5 CHALLENGE**

In [ ]:
%%sql
SELECT order_id,customer_id,order_date FROM orders ORDER BY order_date

 * sqlite:///DATA_ABC.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [ ]:
%%sql
SELECT order_date *MAX(quantity) FROM orders
INNER JOIN order_items ON orders.order_id=order_items.order_id

 * sqlite:///DATA_ABC.db
Done.

[(8092,)]

# **WEEK 1 CHALLENGE**

In [ ]:
%%sql
CREATE TABLE village_location(name VARCHAR(20)
,cordinates DECIMAL(10,10))

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE beneficiary_partner(projects INT,beneficiaries INT)

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE jurisdiction_hierachy( Village VARCHAR(30),district VARCHAR(30),region VARCHAR(30));

 * sqlite:///DATA_ABC.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE datapoints(partner_id INT, partner VARCHAR(30), village VARCHAR(30), beneficiaries VARCHAR(30), beneficiary_type VARCHAR(30))

 * sqlite:///DATA_ABC.db
Done.

[]

%%sql CREATE TABLE summary_district(district_name VARCHAR(30),region_name VARCHAR(30),beneficiaries INT,district_population INT)

%%sql CREATE TABLE summary_partners(Partner_Name VARCHAR(30),villages INT,districts INT)